{ "filename": "markdown"
, "why": "Markdown is an ever-popular markup language that you can use in many places, including in plaintext in your text editor. It is used on GitHub, reddit, and more websites, and also looks good in plaintext. With stenography, we can write Markdown with ease, given the right strokes."
, "how":
  [ "There is a lot to Markdown syntax, so here's how it's been solved, bit by bit. But before you start, this dictionary adds the word Markdown to the dictionary (`PHARBG/TKO*UPB`)."
  , "#### Headers"
  , "Headers are given by the number of headers you want (h1 through h6) with the number bar, and `-RB` (phonetically, sh.). The thought process is, \"I want *x* hash symbols and then to start capitalization.\". The hash symbol by default on Plover is `HAERB`, so this is just the number and SH. `1-RB` through to `6-RB`. If you are having difficulty writing `6-RB`, just hit the number bar with your left hand, and `-FRB` with your right hand."
  , "#### Horizontal Rule"
  , "There are two strokes that make lines out of characters. They are stroked with `HRAOUL` and `HRAO*UL`, which output \"--------------------\" and \"====================\", respectively. The first can be used to make a horizontal rule when surrounded by new lines. They also can be used as underlines which is alternative syntax for h1 (underlined with =) and h2 (underlined with -)"
  , "#### Blockquotes"
  , "For writing blockquotes, just use `KW-T` or `KW*T` which will output \"> \" with the next word capitalized."
  , "#### Bulleted Lists"
  , "For bulleted lists, when you are on a new line, just use `PWHR-T` or `PWHR*T` which will output \"-\" and \"+\", respectively. These will omit spacing before (so you start right at the beginning of the line), and add capitalization to the next stroke."
  , "#### Link"
  , "A link in Markdown is formatted by two square brackets around your text, and parentheses around the link. With the stroke `PH*LG` (M for Markdown, `*LG` for LK), you get the output \"\\[\\]\\(\\)\" with the cursor placed in between the square brackets, ready for adding the link description. You then use the arrow keys to paste or type in your link and continue typing."
  , "#### Images"
  , "Very similar to the link, but instead of the right hand being `*LG`, you do `*PBLG` for the `J` sound in image. `PH*PBLG` which outputs \"!\\[\\]\\(\\)\" with the cursor in the square brackets, ready for the image alt-text."
  , "#### Emphasis"
  , "There are three pairs of strokes for emphasis. Emphasis in Markdown works a lot like quotation marks. The regular stroke is open-emphasis, the asterisk stroke is close-emphasis. The strokes are based off of the phonetics in the word \"emphasis\": `M-FM` which is `PH-FPL` in steno. For *italics*, you use `PH-FPL` and `PH*FPL`. For **bold**, you use `PH-FPLS` and `PH*FPLS` and for ***bold italics***, you can either combo the other two strokes, or just use `PH-FPLSZ` and `PH*FPLSZ`."
  , "#### Code"
  , "For code, you have two different types of strokes. One is `inline-code` which works like quotes. Based off of Plover's default stroke for \\`, `KH-FG` is your open-inline-code, and `KH*FG` is your close-inline-code. For code blocks multi-line, use `SKH-FGS`, which is the same stroke with symmetrical S's added. This will output \\`\\`\\` with no spacing."
  , "#### Escape Character"
  , "There are two escape characters that you can use, `SKPH` outputs \"\\\\\" which you can use to escape characters. `SKPH*` does the same, but doesn't have spacing. Great for using escaped characters inside a word, for example."
  , "#### That's all, folks"
  , "I wish you luck using this dictionary. It's a very large amount to take in, but I hope that you are comfortable using it and that Markdown serves you well!"
  ]
}
